In [1]:
import numpy as np
import pandas as pd

# PANDAS QUESTIONS

13. Write a Pandas program to calculate the sum of the examination attempts by the students.

First of all, let's copy "Exam data" dict and labels list given in the question and run them.

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

if we transform the exam data dict to Dataframe, we can see the data clearly.
For this let's use pandas Dataframe function and assign the labels list as an index.

In [3]:
df = pd.DataFrame(exam_data, index=labels)

In [4]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

then to calculate the sum of the examination attempts by the students let's use the sum method

In [5]:
df.attempts.sum()

19

ok, that's the result.
let's jump the other question

15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. After that, delete the new row and return the original DataFrame.

In [6]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [7]:
df = pd.DataFrame(exam_data, index=labels)

okey we use the same dataframe

In [8]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

for adding a new row, we use loc method and
we must mention the new row's name inside the method, then we must create a list the other side of the equal sign.
this list's length must be equal with the column number of dataframe. Ok, these are the values given in the question

In [9]:
df.loc["k"] = ["Suresh", 15.5, 1, "yes"]

In [10]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

ok as you see, the new row was created

for the second part of the guestion, let's drop the new row, for this we can use drop method

if we want to permanent the change we made ,there are two ways

first one is we equalize the code written for changing to dataframe's name again

or we can use inplace parameter inside the method

In [65]:
df = df.drop("k")
# df.drop("k", inplace=True)

In [66]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
ok as you see, the new row was deleted